Revit 2024 API
ExternalEvent.Create Method
 Creates an instance of external event.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static ExternalEvent Create(
	IExternalEventHandler handler
)
Visual Basic
Public Shared Function Create ( _
	handler As IExternalEventHandler _
) As ExternalEvent
Visual C++
public:
static ExternalEvent^ Create(
	IExternalEventHandler^ handler
)
Parameters
handler
Type: Autodesk.Revit.UI.IExternalEventHandler
 An instance of IExternalEventHandler which will execute the event.
Return Value
 An instance of ExternalEvent class, which will be used to invoke the event
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ExternalEvent Class
Autodesk.Revit.UI Namespace